#+TITLE: DAT505 Summer Omtentamen 2
#+options: toc:nil

** Answer

#+begin_src python :results output :exports both
  def testLine(x):
      return x[0] == x[1] and x[0] == x[2] and x[0] != " "
  def getCols(m):
     for i in range(3):
         yield [m[0][i], m[1][i], m[2][i]]
  def getDiag(m):
      return [m[0][0], m[1][1], m[2][2]]
  class TicTacToe:
      def __init__(self):
        self.state = [[" "," "," "],[" "," "," "],[" "," "," "]]
        self.next = "x"
      def play(self,row,col):
          m = self.state
          if m[row][col] == " ":
              m[row][col] = self.next
              if self.next == "x":
                  self.next = "o"
              else:
                  self.next = "x"
              return True
          else:
              return False
      def gameOver(self):
          m = self.state
          for r in m:
              if testLine(r): return True
          for c in getCols(m):
              if testLine(c): return True
          if testLine(getDiag(m)): return True
          if testLine(getDiag(list(reversed(m)))): return True
          return False

  ##################
  ## TESTING CODE

  assert testLine(["x","x","x"])
  assert testLine(["o","o","o"])
  assert not testLine(["x"," ","x"])
  assert not testLine([" "," "," "])
  # print(list(getCols([["1","2","3"],["4","5","6"],["7","8","9"]])))
  # print(list(getDiag(list(reversed([["1","2","3"],["4","5","6"],["7","8","9"]])))))

  g = TicTacToe()
  g.play(1,1);print(g.gameOver())
  g.play(0,0);print(g.gameOver())
  g.play(1,0);print(g.gameOver())
  g.play(2,2);print(g.gameOver())
  g.play(1,2);print(g.gameOver())
  print (g.state)
#+end_src

#+RESULTS:
: False
: False
: False
: False
: True
: [['o', ' ', ' '], ['x', 'x', 'x'], [' ', ' ', 'o']]
    
